# 정규표현식
- 정규표현식 -> 특수문자 판단
- !@#$!%$@##
- 특수문자 판단은 \특수문자

In [2]:
import re

In [3]:
re.search('\*', '*12')

In [7]:
re.search('\*', '***님') # <- 첫번째 *을 찾는 법

In [8]:
re.search('\*+', '***님') # <- 별을 여러 개 찾는 법

- 정규표현식 요약 용어
- \d [0-9] 숫자를 표현하는 것, 모든 숫자 
- \D [^0-9] 모든 숫자를 제외하고 
- \w [a-zA-Z0-9_] 영문,대소문자, 숫자, 밑줄문자까지
- \W [^a-zA-Z0-9_] 위에 제외하고 다

In [10]:
re.search('\w','applelovephone12344534252352346!!')

In [11]:
re.search('\w+','applelovephone12344534252352346!!')

In [12]:
re.search('\d+','applelovephone12344534252352346!!')

In [13]:
re.search('\D+','applelovephone12344534252352346!!')

- 공백처리
- ' ' : 공백을 직접 넣어도 되고
- \s, \S로 표현 가능

In [14]:
re.search('[a-zA-Z ]+','Hi Hello')

In [15]:
re.search('[a-zA-Z]+','Hi Hello')

In [16]:
re.search('[a-zA-Z\s]+','Hi Hello')

### 정규표현식 그룹으로 묶어서도 사용 가능
- (정규표현식)(정규표현식)
- group(그룹넘버)

In [18]:
re1=re.search('([a-z]+) ([0-9]+)', 'abc 1234')

In [19]:
re1.group(1)

'abc'

In [20]:
re1.group(2)

'1234'

In [22]:
re1.group(0) # <- 0은 전체를 가지고 옴

'abc 1234'

In [23]:
re1.groups() # 두 개의 값을 튜플로 해서 만들기 가능

('abc', '1234')

### 정규표현식과 같이 사용하는 문자열 패턴 문법
- re.findall('패턴', 문자열')
- 매칭된 문자를 리스트로 반환함.

In [24]:
df_str = re.findall('[a-z]+','a 123 b 123 c 421 d') #문자만 전체 다 잡아서 리스트로 만들어줌

In [26]:
df_str

['a', 'b', 'c', 'd']

In [27]:
df_num=re.findall('[0-9]+','a 123 b 123 c 421 d') #숫자만 전체 다 잡아서 리스트로 만들어줌

In [29]:
df_num

['123', '123', '421']

### re.sub('패턴', 바꿀문자열','문자열',바꿀횟수) 
- 특정 문자열을 찾은 뒤 바꿔줘는 함수

In [30]:
re.sub('bdaa','bda', 'bdaa는 8기를 진행하고 있고 bdaa는 이번 페스티벌은 AWS와 진행한다.') 
# 이런 식의 함수들을 응용해서 다양한 문자열 전처리를 할 수 있다.

'bda는 8기를 진행하고 있고 bda는 이번 페스티벌은 AWS와 진행한다.'

---

# 모듈, 패키지

In [31]:
import re
import pandas as pd

- 모듈을 불러와서 사용하는 것
- 내장 함수가 존재하고 그 외에 -> 모듈과 패키지를 불러와서 다양하게 사용할 수 있다.

- 모듈 module 변수, 함수, 클래스 담고 있는 파일 
- 모듈은 이런 특정 기능을 .py 파일 단위로 작성한 것들 말한다.

- 패키지 특정 기능과 관련된 모듈을 묶은 것 ( 모듈을 묶은 형태로 보면 된다. )

- 대부분 불러올 때 
- import 모듈
- import 모듈, 모듈 

- 모듈.변수
- 모듈.함수()
- 모듈.클래스()

In [33]:
import math as m

In [34]:
m.pi

3.141592653589793

In [35]:
m.sqrt(4.0)

2.0

In [36]:
import numpy as np

In [37]:
np.datetime64(54, 'Y')

numpy.datetime64('2024')

In [38]:
import pandas as pd

In [39]:
pd.DataFrame({'A': [1, 2, 3]})

   A
0  1
1  2
2  3

In [40]:
import datetime

In [41]:
pd.Timedelta("1 days")

Timedelta('1 days 00:00:00')

---
##### 타이타닉 데이터 불러오기

In [42]:
import seaborn as sns

In [44]:
tt = sns.load_dataset('titanic')
tt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [46]:
a = [[1,2],[3,4]]
a

[[1, 2], [3, 4]]

In [48]:
a[0][0]   # 2차원 리스트 행과열의 개념 -> DataFrame의 개념과 동일

1

- 데이터프레임 형태로 저장되어 있다.
- 데이터를 추출하는 방법
- 데이터프레임은 2차원 구조로 되어있고, 행과 열로 
- 2차원리스트의 개념으로 이해해서
- 데이터의 컬럼을 기준으로 값을 뽑아보자!
- survived, sex,age,fare
- 원하는 컬럼만 추출하자 위의 컬럼들을 추출하자!

- 판다스 문법은 컬럼을 추출할 때 [] 리스트 안에 넣어서 추출한다.
- 1개의 컬럼만 추출하게 되면

In [49]:
tt['survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [52]:
tt_df = tt[['survived','sex','age','fare']]
tt_df

     survived     sex   age     fare
0           0    male  22.0   7.2500
1           1  female  38.0  71.2833
2           1  female  26.0   7.9250
3           1  female  35.0  53.1000
4           0    male  35.0   8.0500
..        ...     ...   ...      ...
886         0    male  27.0  13.0000
887         1  female  19.0  30.0000
888         0  female   NaN  23.4500
889         1    male  26.0  30.0000
890         0    male  32.0   7.7500

[891 rows x 4 columns]

## 추출한 데이터 중에서 인덱스 기준으로 데이터 값 뽑아내기
- 인덱스 기준으로 뽑기 위해서는 문법이 필요.
- loc, iloc 
- loc 함수이용해서 인덱스를 뽑는 것

In [53]:
tt_df.loc[886] #df 라서 문법 loc이 필요하다.

survived       0
sex         male
age         27.0
fare        13.0
Name: 886, dtype: object